### terraform plan: `domains`

<details>
<summary>🟢 <strong>terraform init</strong></summary>  

~~~
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- bts_crew_com in domain
- bts_finance_co_uk in domain
Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.63.0...
- Installed hashicorp/aws v5.63.0 (signed by HashiCorp)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
~~~             
</details>

<details>
<summary>🟢 <strong>terraform validate</strong></summary>  

~~~
Success! The configuration is valid.
~~~             
</details>

<details>
<summary>🟢 <strong>terraform plan</strong> (1 to add, 0 to change, 0 to destroy)</summary>  

~~~
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bts_finance_co_uk.aws_route53_record.default["TXT/_gh_backstage_technical_services_o_bts_finance_co_uk"] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_gh-backstage-technical-services-o"
      + records         = [
          + "5345929fe0",
        ]
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z04942743RZX4OXLJF444"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"
~~~             
</details>

---
[View the run details](https://github.com/backstage-technical-services/terraform/actions/runs/14740872827?check_suite_focus=true)
<!-- thollander/actions-comment-pull-request "domains" -->